#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db]
azurerm_service_plan.app_plan: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web]
azurerm_app_service.webapp: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/terraform-web-019]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_app_service.webapp has changed
  ~ resource "azurerm_app_service" "webapp" {
        id                                = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/terraform-web-019"
        name                              = "terraform-web-019"
      + tags                              = {}
        # (17 unchanged attributes hidden)




      ~ site_config {
          + default_documents                    = []
            # (18 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_service_plan.app_plan has changed
  ~ resource "azurerm_service_plan" "app_plan" {
        id                           = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web"
        name                         = "appserviceplan-web"
      + tags                         = {}
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service.webapp must be replaced
-/+ resource "azurerm_app_service" "webapp" {
      ~ app_service_plan_id               = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web" -> (known after apply)
      ~ client_cert_mode                  = "Required" -> (known after apply)
      ~ custom_domain_verification_id     = "DF0B4BB4814E8042F44F076D46BFB6F39E274E13A710920AD11386B0425E0F63" -> (known after apply)
      ~ default_site_hostname             = "terraform-web-019.azurewebsites.net" -> (known after apply)
      ~ id                                = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/sites/terraform-web-019" -> (known after apply)
      ~ key_vault_reference_identity_id   = "SystemAssigned" -> (known after apply)
      ~ location                          = "westeurope" -> "northeurope" # forces replacement
        name                              = "terraform-web-019"
      ~ outbound_ip_address_list          = [
          - "40.114.177.114",
          - "20.54.232.60",
          - "20.54.143.191",
          - "51.137.9.106",
          - "20.54.232.86",
          - "51.137.11.192",
          - "20.50.2.21",
        ] -> (known after apply)
      ~ outbound_ip_addresses             = "40.114.177.114,20.54.232.60,20.54.143.191,51.137.9.106,20.54.232.86,51.137.11.192,20.50.2.21" -> (known after apply)
      ~ possible_outbound_ip_address_list = [
          - "40.114.177.114",
          - "20.54.232.60",
          - "20.54.143.191",
          - "51.137.9.106",
          - "20.54.232.86",
          - "51.137.11.192",
          - "20.54.232.116",
          - "20.54.232.153",
          - "20.54.233.52",
          - "51.138.93.20",
          - "20.54.233.188",
          - "51.124.64.196",
          - "20.54.234.122",
          - "20.54.235.71",
          - "20.54.235.162",
          - "20.54.236.103",
          - "20.54.236.170",
          - "20.54.237.222",
          - "20.82.35.153",
          - "20.82.34.16",
          - "20.82.32.216",
          - "20.82.35.188",
          - "20.82.35.197",
          - "20.82.35.207",
          - "20.50.2.21",
        ] -> (known after apply)
      ~ possible_outbound_ip_addresses    = "40.114.177.114,20.54.232.60,20.54.143.191,51.137.9.106,20.54.232.86,51.137.11.192,20.54.232.116,20.54.232.153,20.54.233.52,51.138.93.20,20.54.233.188,51.124.64.196,20.54.234.122,20.54.235.71,20.54.235.162,20.54.236.103,20.54.236.170,20.54.237.222,20.82.35.153,20.82.34.16,20.82.32.216,20.82.35.188,20.82.35.197,20.82.35.207,20.50.2.21" -> (known after apply)
      ~ site_credential                   = [
          - {
              - password = "CawR2Ltubf2K1tv1i3T2J73Jbi6dG7lj8jNzkJHhlg3ZGeNha2wLt1rkzwXe"
              - username = "$terraform-web-019"
            },
        ] -> (known after apply)
      - tags                              = {} -> null
        # (6 unchanged attributes hidden)

      ~ auth_settings {
          ~ additional_login_params        = {} -> (known after apply)
          ~ allowed_external_redirect_urls = [] -> (known after apply)
          + default_provider               = (known after apply)
          ~ enabled                        = false -> (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          ~ token_refresh_extension_hours  = 0 -> (known after apply)
          ~ token_store_enabled            = false -> (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }


      ~ logs {
          ~ detailed_error_messages_enabled = false -> (known after apply)
          ~ failed_request_tracing_enabled  = false -> (known after apply)

          ~ application_logs {
              ~ file_system_level = "Off" -> (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          ~ http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      ~ site_config {
          - default_documents                    = [] -> null
          ~ ftps_state                           = "AllAllowed" -> (known after apply)
          ~ ip_restriction                       = [] -> (known after apply)
          + linux_fx_version                     = (known after apply)
          ~ local_mysql_enabled                  = false -> (known after apply)
          ~ managed_pipeline_mode                = "Integrated" -> (known after apply)
          ~ min_tls_version                      = "1.2" -> (known after apply)
          ~ number_of_workers                    = 1 -> (known after apply)
          ~ remote_debugging_version             = "VS2019" -> (known after apply)
          ~ scm_ip_restriction                   = [] -> (known after apply)
          - use_32_bit_worker_process            = false -> null
          ~ vnet_route_all_enabled               = false -> (known after apply)
          ~ websockets_enabled                   = false -> (known after apply)
          + windows_fx_version                   = (known after apply)
            # (7 unchanged attributes hidden)

          ~ cors {
              ~ allowed_origins     = [] -> (known after apply)
              ~ support_credentials = false -> (known after apply)
            }
        }

      ~ source_control {
          ~ branch             = "main" -> (known after apply)
          ~ manual_integration = false -> (known after apply)
          ~ repo_url           = "https://terraform-web-019.scm.azurewebsites.net" -> (known after apply)
          ~ rollback_enabled   = false -> (known after apply)
          ~ use_mercurial      = false -> (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
        # (1 unchanged block hidden)
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db" -> (known after apply)
      ~ location = "westeurope" -> "northeurope" # forces replacement
        name     = "rg-terraform-web-sql-db"
        tags     = {
            "environment" = "production"
        }
    }

  # azurerm_service_plan.app_plan must be replaced
-/+ resource "azurerm_service_plan" "app_plan" {
      ~ id                           = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/rg-terraform-web-sql-db/providers/Microsoft.Web/serverfarms/appserviceplan-web" -> (known after apply)
      ~ kind                         = "linux" -> (known after apply)
      ~ location                     = "westeurope" -> "northeurope" # forces replacement
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
        name                         = "appserviceplan-web"
      ~ reserved                     = true -> (known after apply)
      - tags                         = {} -> null
      ~ worker_count                 = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_sql_database.db will be created
  + resource "azurerm_sql_database" "db" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "northeurope"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "terraform-sqldatabase20"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = "rg-terraform-web-sql-db"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "terraform-sqlserver-019"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # azurerm_sql_server.sqldb will be created
  + resource "azurerm_sql_server" "sqldb" {
      + administrator_login          = "user01"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "northeurope"
      + name                         = "terraform-sqlserver-019"
      + resource_group_name          = "rg-terraform-web-sql-db"
      + version                      = "12.0"

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ webapp_ips = "40.114.177.114,20.54.232.60,20.54.143.191,51.137.9.106,20.54.232.86,51.137.11.192,20.50.2.21" -> (known after apply)
  ~ webapp_url = "terraform-web-019.azurewebsites.net" -> (known after apply)

Warning: Deprecated Resource

  with azurerm_app_service.webapp,
  on main.tf line 18, in resource "azurerm_app_service" "webapp":
  18: resource "azurerm_app_service" "webapp" {

The `azurerm_app_service` resource has been superseded by the
`azurerm_linux_web_app` and `azurerm_windows_web_app` resources. Whilst this
resource will continue to be available in the 2.x and 3.x releases it is
feature-frozen for compatibility purposes, will no longer receive any updates
and will be removed in a future major release of the Azure Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @HoussemDellai, Action: `pull_request`, Working Directory: ``, Workflow: `Create Infra with Terraform`*